6.9
ITIM VPN
08-07-21
SERVER
TH-CAT 5 SERVER
TH-GAMING 5 SERVER
TH-INET 5 SERVER
SG-VPS 5 SERVER
SG-AUTO 10 SERVER
VIP-CAT 2 SERVER
VIP-GAMING 1 Server
เซิฟ VIP-CAT เช่าเดือนละ20บาท
เซิฟ VIP-GAMING เช่าเดือนละ30บาท
สนใจเช่าติดต่อทักแชทที่FB.เสี่ยเอก มงคล
########################
-เลือกใช้ไฟล์ให้ตรงกับโปรที่สมัคร
-กดอัพเดตไฟล์ในแอพบ่อยๆ
-เซิฟไหนไฟล์ไหนไม่ติดให้เปลี่ยนไปใช้เซิฟอื่นไฟล์อื่นนะครับ
-เล่นเกมส์ให้ใช้เซิฟ TH-GAMING
-ใช้งานทั่วไปให้ใช้เซิฟ TH-CAT,TH-INET,SG
*หมายเหตุ: ช่วยรีวิว+ให้คะแนนแอพด้วยนะครับ
